{"config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["activation_1", 0, 0]], "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 1, 48, 48], "name": "input_1"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "padding": "same", "trainable": true, "filters": 32, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_1", "data_format": "channels_first"}, "class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "padding": "same", "trainable": true, "filters": 32, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_2", "data_format": "channels_first"}, "class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "padding": "same", "trainable": true, "filters": 64, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_3", "data_format": "channels_first"}, "class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "dropout_2", "seed": null, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "padding": "same", "trainable": true, "filters": 64, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_4", "data_format": "channels_first"}, "class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "padding": "same", "trainable": true, "filters": 128, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_5", "data_format": "channels_first"}, "class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "dropout_3", "seed": null, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout", "name": "dropout_3", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "padding": "same", "trainable": true, "filters": 128, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_6", "data_format": "channels_first"}, "class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"config": {"trainable": true, "size": [2, 2], "name": "up_sampling2d_1", "data_format": "channels_last"}, "class_name": "UpSampling2D", "name": "up_sampling2d_1", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "concatenate_1", "axis": 1}, "class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "padding": "same", "trainable": true, "filters": 64, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_7", "data_format": "channels_first"}, "class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "dropout_4", "seed": null, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout", "name": "dropout_4", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "padding": "same", "trainable": true, "filters": 64, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_8", "data_format": "channels_first"}, "class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"config": {"trainable": true, "size": [2, 2], "name": "up_sampling2d_2", "data_format": "channels_last"}, "class_name": "UpSampling2D", "name": "up_sampling2d_2", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "concatenate_2", "axis": 1}, "class_name": "Concatenate", "name": "concatenate_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "padding": "same", "trainable": true, "filters": 32, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_9", "data_format": "channels_first"}, "class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "dropout_5", "seed": null, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout", "name": "dropout_5", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "padding": "same", "trainable": true, "filters": 32, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_10", "data_format": "channels_first"}, "class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "padding": "same", "trainable": true, "filters": 2, "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_11", "data_format": "channels_first"}, "class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "reshape_1", "target_shape": [2, 2304]}, "class_name": "Reshape", "name": "reshape_1", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"config": {"dims": [2, 1], "trainable": true, "name": "permute_1"}, "class_name": "Permute", "name": "permute_1", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["permute_1", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.3"}