{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.3", "config": {"name": "model_1", "output_layers": [["activation_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 1, 48, 48], "sparse": false}}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "kernel_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "filters": 32, "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3]}}, {"name": "dropout_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "conv2d_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "kernel_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "filters": 32, "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3]}}, {"name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2]}}, {"name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "kernel_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "filters": 64, "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3]}}, {"name": "dropout_2", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "conv2d_4", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "kernel_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "filters": 64, "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3]}}, {"name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2]}}, {"name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "kernel_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "filters": 128, "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3]}}, {"name": "dropout_3", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "conv2d_6", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "kernel_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "filters": 128, "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3]}}, {"name": "up_sampling2d_1", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "size": [2, 2], "data_format": "channels_last"}}, {"name": "concatenate_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_1", "axis": 1, "trainable": true}}, {"name": "conv2d_7", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_7", "kernel_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "filters": 64, "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3]}}, {"name": "dropout_4", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "conv2d_8", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_8", "kernel_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "filters": 64, "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3]}}, {"name": "up_sampling2d_2", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "trainable": true, "size": [2, 2], "data_format": "channels_last"}}, {"name": "concatenate_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_2", "axis": 1, "trainable": true}}, {"name": "conv2d_9", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_9", "kernel_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "filters": 32, "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3]}}, {"name": "dropout_5", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "conv2d_10", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_10", "kernel_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "filters": 32, "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3]}}, {"name": "conv2d_11", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_11", "kernel_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "filters": 2, "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1]}}, {"name": "reshape_1", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [2, 2304]}}, {"name": "permute_1", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Permute", "config": {"name": "permute_1", "trainable": true, "dims": [2, 1]}}, {"name": "activation_1", "inbound_nodes": [[["permute_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "input_layers": [["input_1", 0, 0]]}}