{"backend": "tensorflow", "keras_version": "2.1.3", "config": {"layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 1, 48, 48], "sparse": false, "name": "input_1", "dtype": "float32"}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "filters": 32, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_1", "activation": "relu", "kernel_constraint": null, "data_format": "channels_first", "bias_constraint": null, "use_bias": true}, "name": "conv2d_1", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"rate": 0.2, "trainable": true, "seed": null, "name": "dropout_1", "noise_shape": null}, "name": "dropout_1", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "filters": 32, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_2", "activation": "relu", "kernel_constraint": null, "data_format": "channels_first", "bias_constraint": null, "use_bias": true}, "name": "conv2d_2", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1"}, "name": "max_pooling2d_1", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "filters": 64, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_3", "activation": "relu", "kernel_constraint": null, "data_format": "channels_first", "bias_constraint": null, "use_bias": true}, "name": "conv2d_3", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"rate": 0.2, "trainable": true, "seed": null, "name": "dropout_2", "noise_shape": null}, "name": "dropout_2", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "filters": 64, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_4", "activation": "relu", "kernel_constraint": null, "data_format": "channels_first", "bias_constraint": null, "use_bias": true}, "name": "conv2d_4", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2"}, "name": "max_pooling2d_2", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "filters": 128, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_5", "activation": "relu", "kernel_constraint": null, "data_format": "channels_first", "bias_constraint": null, "use_bias": true}, "name": "conv2d_5", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"rate": 0.2, "trainable": true, "seed": null, "name": "dropout_3", "noise_shape": null}, "name": "dropout_3", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "filters": 128, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_6", "activation": "relu", "kernel_constraint": null, "data_format": "channels_first", "bias_constraint": null, "use_bias": true}, "name": "conv2d_6", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"data_format": "channels_last", "size": [2, 2], "name": "up_sampling2d_1", "trainable": true}, "name": "up_sampling2d_1", "class_name": "UpSampling2D"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]], "config": {"name": "concatenate_1", "axis": 1, "trainable": true}, "name": "concatenate_1", "class_name": "Concatenate"}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "filters": 64, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_7", "activation": "relu", "kernel_constraint": null, "data_format": "channels_first", "bias_constraint": null, "use_bias": true}, "name": "conv2d_7", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"rate": 0.2, "trainable": true, "seed": null, "name": "dropout_4", "noise_shape": null}, "name": "dropout_4", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "filters": 64, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_8", "activation": "relu", "kernel_constraint": null, "data_format": "channels_first", "bias_constraint": null, "use_bias": true}, "name": "conv2d_8", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"data_format": "channels_last", "size": [2, 2], "name": "up_sampling2d_2", "trainable": true}, "name": "up_sampling2d_2", "class_name": "UpSampling2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]], "config": {"name": "concatenate_2", "axis": 1, "trainable": true}, "name": "concatenate_2", "class_name": "Concatenate"}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "filters": 32, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_9", "activation": "relu", "kernel_constraint": null, "data_format": "channels_first", "bias_constraint": null, "use_bias": true}, "name": "conv2d_9", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"rate": 0.2, "trainable": true, "seed": null, "name": "dropout_5", "noise_shape": null}, "name": "dropout_5", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_5", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "filters": 32, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_10", "activation": "relu", "kernel_constraint": null, "data_format": "channels_first", "bias_constraint": null, "use_bias": true}, "name": "conv2d_10", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "filters": 2, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_11", "activation": "relu", "kernel_constraint": null, "data_format": "channels_first", "bias_constraint": null, "use_bias": true}, "name": "conv2d_11", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"target_shape": [2, 2304], "name": "reshape_1", "trainable": true}, "name": "reshape_1", "class_name": "Reshape"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"name": "permute_1", "dims": [2, 1], "trainable": true}, "name": "permute_1", "class_name": "Permute"}, {"inbound_nodes": [[["permute_1", 0, 0, {}]]], "config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "name": "activation_1", "class_name": "Activation"}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_1", 0, 0]]}, "class_name": "Model"}