{"class_name": "Model", "keras_version": "2.1.3", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 1, 48, 48], "dtype": "float32", "name": "input_1", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "data_format": "channels_first", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "name": "conv2d_1", "padding": "same", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "rate": 0.2, "noise_shape": null, "name": "dropout_1", "seed": null}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "data_format": "channels_first", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "name": "conv2d_2", "padding": "same", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "data_format": "channels_first", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "name": "conv2d_3", "padding": "same", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_2", "config": {"trainable": true, "rate": 0.2, "noise_shape": null, "name": "dropout_2", "seed": null}}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "data_format": "channels_first", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "name": "conv2d_4", "padding": "same", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "data_format": "channels_first", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "name": "conv2d_5", "padding": "same", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_3", "config": {"trainable": true, "rate": 0.2, "noise_shape": null, "name": "dropout_3", "seed": null}}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "data_format": "channels_first", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "name": "conv2d_6", "padding": "same", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_1", "config": {"trainable": true, "name": "up_sampling2d_1", "size": [2, 2], "data_format": "channels_last"}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1", "config": {"trainable": true, "name": "concatenate_1", "axis": 1}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "data_format": "channels_first", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "name": "conv2d_7", "padding": "same", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_4", "config": {"trainable": true, "rate": 0.2, "noise_shape": null, "name": "dropout_4", "seed": null}}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "data_format": "channels_first", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "name": "conv2d_8", "padding": "same", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_2", "config": {"trainable": true, "name": "up_sampling2d_2", "size": [2, 2], "data_format": "channels_last"}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_2", "config": {"trainable": true, "name": "concatenate_2", "axis": 1}}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "data_format": "channels_first", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "name": "conv2d_9", "padding": "same", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_5", "config": {"trainable": true, "rate": 0.2, "noise_shape": null, "name": "dropout_5", "seed": null}}, {"inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "data_format": "channels_first", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "name": "conv2d_10", "padding": "same", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "data_format": "channels_first", "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "filters": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "name": "conv2d_11", "padding": "same", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape_1", "config": {"trainable": true, "name": "reshape_1", "target_shape": [2, 2304]}}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Permute", "name": "permute_1", "config": {"trainable": true, "dims": [2, 1], "name": "permute_1"}}, {"inbound_nodes": [[["permute_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}], "output_layers": [["activation_1", 0, 0]]}, "backend": "tensorflow"}