{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 1, 48, 48]}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"activation": "relu", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "filters": 32, "name": "conv2d_1", "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "use_bias": true}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_1", "seed": null, "trainable": true}, "name": "dropout_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "filters": 32, "name": "conv2d_2", "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "use_bias": true}, "name": "conv2d_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1", "trainable": true}, "name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "filters": 64, "name": "conv2d_3", "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "use_bias": true}, "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_2", "seed": null, "trainable": true}, "name": "dropout_2", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "filters": 64, "name": "conv2d_4", "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "use_bias": true}, "name": "conv2d_4", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_2", "trainable": true}, "name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "filters": 128, "name": "conv2d_5", "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "use_bias": true}, "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_3", "seed": null, "trainable": true}, "name": "dropout_3", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "filters": 128, "name": "conv2d_6", "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "use_bias": true}, "name": "conv2d_6", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"data_format": "channels_last", "name": "up_sampling2d_1", "trainable": true, "size": [2, 2]}, "name": "up_sampling2d_1", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 1, "name": "concatenate_1", "trainable": true}, "name": "concatenate_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "filters": 64, "name": "conv2d_7", "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "use_bias": true}, "name": "conv2d_7", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_4", "seed": null, "trainable": true}, "name": "dropout_4", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "filters": 64, "name": "conv2d_8", "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "use_bias": true}, "name": "conv2d_8", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"data_format": "channels_last", "name": "up_sampling2d_2", "trainable": true, "size": [2, 2]}, "name": "up_sampling2d_2", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 1, "name": "concatenate_2", "trainable": true}, "name": "concatenate_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "filters": 32, "name": "conv2d_9", "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "use_bias": true}, "name": "conv2d_9", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_5", "seed": null, "trainable": true}, "name": "dropout_5", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "filters": 32, "name": "conv2d_10", "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "use_bias": true}, "name": "conv2d_10", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "trainable": true, "filters": 2, "name": "conv2d_11", "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "use_bias": true}, "name": "conv2d_11", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_1", "target_shape": [2, 2304], "trainable": true}, "name": "reshape_1", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_1", "dims": [2, 1], "trainable": true}, "name": "permute_1", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "name": "activation_1", "inbound_nodes": [[["permute_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["activation_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.1.3"}